docs: update README format to match gorouter style
